**Name - Shravani Sandeep Raut**

SE - 48

Q] Create a Pandas DataFrame from the following dataset:

Name Age Salary Department

John 25 50000 HR

Alice 30 70000 IT

Bob 35 60000 Finance

Carol 28 65000 Marketing

David 40 80000 IT


• Display the first and last two rows of the DataFrame.

• Retrieve the Salary column and compute its mean and standard deviation.

• Filter employees who are older than 30 and belong to the IT department.

• Add a new column Bonus where the bonus is 10% of the salary

In [10]:
import pandas as pd

In [11]:
data = {
    'Name': ['John', 'Alice', 'Bob', 'Carol', 'David'],
    'Age': [25, 30, 35, 28, 40],
    'Salary': [50000, 70000, 60000, 65000, 80000],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'IT']
}

df = pd.DataFrame(data)
df

    Name  Age  Salary Department
0   John   25   50000         HR
1  Alice   30   70000         IT
2    Bob   35   60000    Finance
3  Carol   28   65000  Marketing
4  David   40   80000         IT

In [12]:
print("First two rows:")
display(df.head(2))

print("Last two rows:")
display(df.tail(2))

First two rows:

    Name  Age  Salary Department
0   John   25   50000         HR
1  Alice   30   70000         IT

Last two rows:

    Name  Age  Salary Department
3  Carol   28   65000  Marketing
4  David   40   80000         IT

In [13]:
mean_salary = df['Salary'].mean()
std_salary = df['Salary'].std()

print(f"Mean Salary: {mean_salary}")
print(f"Standard Deviation of Salary: {std_salary}")

Mean Salary: 65000.0
Standard Deviation of Salary: 11180.339887498949

In [14]:
filtered = df[(df['Age'] > 30) & (df['Department'] == 'IT')]
filtered

    Name  Age  Salary Department
4  David   40   80000         IT

In [15]:
df['Bonus'] = df['Salary'] * 0.10
df

    Name  Age  Salary Department   Bonus
0   John   25   50000         HR  5000.0
1  Alice   30   70000         IT  7000.0
2    Bob   35   60000    Finance  6000.0
3  Carol   28   65000  Marketing  6500.0
4  David   40   80000         IT  8000.0